# Pandas DataFrame Oluşturma

pd.DataFrame()

* DataFrame oluşturabiliriz.
* columns parametresi ile kolon isimlerini belirleyebiliriz.
* index parametresi ile index isimlerini belirleyebiliriz.

In [7]:
import pandas as pd
import numpy as np

s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [8]:
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}
df = pd.DataFrame(sozluk)

In [9]:
df

   var1  var2  var3
0     7     3     1
1     5     0     0
2     7     9     6
3     9     6     4
4     7     1     7

In [10]:
df[0:1]

   var1  var2  var3
0     7     3     1

In [11]:
df.index = ["a","b","c","d","e"]

In [12]:
df

   var1  var2  var3
a     7     3     1
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [13]:
df[0:1]

   var1  var2  var3
a     7     3     1

In [14]:
df["c":"e"]

   var1  var2  var3
c     7     9     6
d     9     6     4
e     7     1     7

* df.drop() ile kolon veya satır silme işlemi yapabiliriz.
* axis=1 ile kolon silme işlemi yapabiliriz.
* axis=0 ile satır silme işlemi yapabiliriz.

In [15]:
df.drop("a",axis=0)

   var1  var2  var3
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [16]:
df

   var1  var2  var3
a     7     3     1
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

inplace parametresi ile değişikliği kalıcı kaydetme işlemi yapabiliriz. Diğer durumlarda değişiklikler geçici olarak kaydedilir.

In [17]:
df.drop("a",inplace=True)

In [18]:
df

   var1  var2  var3
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [19]:
l = ["var1","var2","var3"]
for i in l:
    print(i in l)

True
True
True

In [23]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     5     0     0       inf
c     7     9     6  0.777778
d     9     6     4  1.500000
e     7     1     7  7.000000

In [27]:
df["var4"] = df["var1"] / df["var2"]
df.drop("var4",axis=1,inplace=True)
df

   var1  var2  var3
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [29]:
l = ["var1","var2"]
df.drop(l,axis=1)

   var3
b     0
c     6
d     4
e     7

# Gözlem ve Değişken Seçimi

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    13    29    23
1     5    11    29
2    14     4    19
3    21     1     2
4    15    29    27
5     1    19    11
6    15    13    16
7    25     2     3
8     1    26    27
9     8    20     9

# iloc

* Alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.

In [2]:
df.iloc[0:3]

   var1  var2  var3
0    13    29    23
1     5    11    29
2    14     4    19

In [3]:
df.iloc[0,0]

np.int32(13)

In [4]:
df.iloc[:3,:2]

   var1  var2
0    13    29
1     5    11
2    14     4

In [5]:
df.loc[0:3,"var3"]

0    23
1    29
2    19
3     2
Name: var3, dtype: int32

In [6]:
df.iloc[0:3,0:2]

   var1  var2
0    13    29
1     5    11
2    14     4

# Koşullu Eleman İşlemleri

In [7]:
df[df.var1 > 15]

   var1  var2  var3
3    21     1     2
7    25     2     3

In [8]:
df[df.var1 % 2 == 0]

   var1  var2  var3
2    14     4    19
9     8    20     9

In [9]:
df.loc[(df.var1 > 15) & (df.var3 < 15), "var2"]

3    1
7    2
Name: var2, dtype: int32

In [10]:
df

   var1  var2  var3
0    13    29    23
1     5    11    29
2    14     4    19
3    21     1     2
4    15    29    27
5     1    19    11
6    15    13    16
7    25     2     3
8     1    26    27
9     8    20     9

In [11]:
df.query("var1 > 15 & var3 < 15")

   var1  var2  var3
3    21     1     2
7    25     2     3

# Birleştirme (Join) İşlemleri

In [12]:
df2 = df + 99
df2

   var1  var2  var3
0   112   128   122
1   104   110   128
2   113   103   118
3   120   100   101
4   114   128   126
5   100   118   110
6   114   112   115
7   124   101   102
8   100   125   126
9   107   119   108

.concat() fonksiyonu ile iki dataframe'i birleştirebiliriz. ignore_index parametresi ile indexleri sıfırlayabiliriz.

join parametresi ile hangi kolon üzerinden birleştirileceğini belirleyebiliriz.

In [13]:
pd.concat([df,df2])

   var1  var2  var3
0    13    29    23
1     5    11    29
2    14     4    19
3    21     1     2
4    15    29    27
5     1    19    11
6    15    13    16
7    25     2     3
8     1    26    27
9     8    20     9
0   112   128   122
1   104   110   128
2   113   103   118
3   120   100   101
4   114   128   126
5   100   118   110
6   114   112   115
7   124   101   102
8   100   125   126
9   107   119   108

In [14]:
pd.concat([df,df2], ignore_index=True)

    var1  var2  var3
0     13    29    23
1      5    11    29
2     14     4    19
3     21     1     2
4     15    29    27
5      1    19    11
6     15    13    16
7     25     2     3
8      1    26    27
9      8    20     9
10   112   128   122
11   104   110   128
12   113   103   118
13   120   100   101
14   114   128   126
15   100   118   110
16   114   112   115
17   124   101   102
18   100   125   126
19   107   119   108

In [18]:
df2.columns = ["var1", "var2", "var3"]  
pd.concat([df, df2], join="inner")

   var1  var2  var3
0    13    29    23
1     5    11    29
2    14     4    19
3    21     1     2
4    15    29    27
5     1    19    11
6    15    13    16
7    25     2     3
8     1    26    27
9     8    20     9
0   112   128   122
1   104   110   128
2   113   103   118
3   120   100   101
4   114   128   126
5   100   118   110
6   114   112   115
7   124   101   102
8   100   125   126
9   107   119   108

# İleri Birleştirme İşlemleri